IDENTIFICATION DIVISION.
PROGRAM-ID. AVERAGE-SALARY.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT EMPLOYEE-FILE ASSIGN TO "employees.dat"
        ORGANIZATION IS SEQUENTIAL
        ACCESS MODE IS SEQUENTIAL
        FILE STATUS IS FS-EMPLOYEE-FILE.

DATA DIVISION.
FILE SECTION.
FD EMPLOYEE-FILE.
    01 EMPLOYEE-RECORD.
        02 NAME PIC X(30).
        02 JOB-TITLE PIC X(30).
        02 SALARY PIC S9(4)V9(2).

WORKING-STORAGE SECTION.
    01 JOB-TOTALS.
        02 JOB-TOTAL OCCURS 30 TIMES.
            03 JOB-TITLE PIC X(30).
            03 NUM-EMPLOYEES PIC 9(4).
            03 TOTAL-SALARY PIC S9(4)V9(2).
    01 FS-EMPLOYEE-FILE PIC X(2).

PROCEDURE DIVISION.
    OPEN INPUT EMPLOYEE-FILE
    READ EMPLOYEE-FILE
        AT END SET FS-EMPLOYEE-FILE TO "10"
    END-READ
    PERFORM UNTIL FS-EMPLOYEE-FILE NOT = "00"
        ADD 1 TO NUM-EMPLOYEES OF JOB-TOTAL(1) OF JOB-TOTALS
        ADD SALARY TO TOTAL-SALARY OF JOB-TOTAL(1) OF JOB-TOTALS
        READ EMPLOYEE-FILE
            AT END SET FS-EMPLOYEE-FILE TO "10"
        END-READ
    END-PERFORM
    CLOSE EMPLOYEE-FILE

    * Calculate averages
    PERFORM VARYING JOB FROM 1 BY 1 UNTIL JOB > 30
        DIVIDE TOTAL-SALARY OF JOB-TOTAL(JOB) OF JOB-TOTALS
            BY NUM-EMPLOYEES OF JOB-TOTAL(JOB) OF JOB-TOTALS
            GIVING AVERAGE-SALARY
        DISPLAY JOB-TITLE OF JOB-TOTAL(JOB) OF JOB-TOTALS
            ": " AVERAGE-SALARY
    END-PERFORM

    STOP RUN.